In [80]:
import pandas as pd

In [82]:
df=pd.read_csv("info.csv")
df.head()

      NAME  AGE
0   karthi   22
1   sahana   20
2   vishnu   25
3   ramesh   30
4  yuvaraj   40

In [84]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13 entries, 0 to 12
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    13 non-null     object
 1   AGE     13 non-null     int64
dtypes: int64(1), object(1)
memory usage: 340.0+ bytes